test/load/load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm-up"
    
    # Ramp-up phase
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: "Ramp-up"
    
    # Sustained load phase
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    
    # Peak load phase
    - duration: 120
      arrivalRate: 50
      rampTo: 100
      name: "Peak load"
    
    # Cool-down phase
    - duration: 60
      arrivalRate: 100
      rampTo: 5
      name: "Cool-down"

  payload:
    path: "./test-data.csv"
    fields:
      - "email"
      - "password"
      - "username"

  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true

scenarios:
  - name: "User Registration Flow"
    weight: 20
    flow:
      - post:
          url: "/api/auth/register"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
            username: "{{ username }}"
          capture:
            - json: "$.token"
              as: "authToken"
            - json: "$.user.id"
              as: "userId"
          expect:
            - statusCode: 201

  - name: "User Login and Dashboard"
    weight: 40
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "test@morphsave.com"
            password: "TestPassword123!"
          capture:
            - json: "$.token"
              as: "authToken"
            - json: "$.user.id"
              as: "userId"
          expect:
            - statusCode: 200
      
      - get:
          url: "/api/auth/me"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      
      - get:
          url: "/api/savings/summary"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  - name: "Savings Operations"
    weight: 25
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "test@morphsave.com"
            password: "TestPassword123!"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 200
      
      - post:
          url: "/api/savings/deposit"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            amount: "{{ $randomInt(10, 500) }}"
            source: "checking"
          expect:
            - statusCode: 200
      
      - post:
          url: "/api/savings/roundup"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            originalAmount: "{{ $randomInt(5, 100) }}.{{ $randomInt(10, 99) }}"
            merchant: "Test Merchant"
            category: "food_and_drink"
          expect:
            - statusCode: 200
      
      - get:
          url: "/api/savings/transactions"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  - name: "Social Features"
    weight: 10
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "test@morphsave.com"
            password: "TestPassword123!"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 200
      
      - get:
          url: "/api/social/friends"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      
      - get:
          url: "/api/social/challenges"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      
      - get:
          url: "/api/achievements"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  - name: "AI Insights"
    weight: 5
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "test@morphsave.com"
            password: "TestPassword123!"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 200
      
      - get:
          url: "/api/insights/analysis"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      
      - get:
          url: "/api/insights/recommendations"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

# Error handling scenarios
  - name: "Error Scenarios"
    weight: 5
    flow:
      # Test invalid login
      - post:
          url: "/api/auth/login"
          json:
            email: "invalid@example.com"
            password: "wrongpassword"
          expect:
            - statusCode: 401
      
      # Test unauthorized access
      - get:
          url: "/api/savings/summary"
          expect:
            - statusCode: 401
      
      # Test invalid data
      - post:
          url: "/api/auth/login"
          json:
            email: "test@morphsave.com"
            password: "TestPassword123!"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 200
      
      - post:
          url: "/api/savings/deposit"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            amount: -100
            source: "invalid"
          expect:
            - statusCode: 400